Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/gpio.h
/* -------- GPIO_LATCLR : (GPIO Offset: 0x34) (R/W 32)  -------- */
#define GPIO_LATCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_LATCLR)   Reset Value */

#define GPIO_LATCLR_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_LATCLR) Register Mask  */


/* -------- GPIO_LATSET : (GPIO Offset: 0x38) (R/W 32)  -------- */
#define GPIO_LATSET_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_LATSET)   Reset Value */

#define GPIO_LATSET_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_LATSET) Register Mask  */


/* -------- GPIO_LATINV : (GPIO Offset: 0x3C) (R/W 32)  -------- */
#define GPIO_LATINV_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_LATINV)   Reset Value */

#define GPIO_LATINV_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_LATINV) Register Mask  */


/* -------- GPIO_ODC : (GPIO Offset: 0x40) (R/W 32)  -------- */
#define GPIO_ODC_RESETVALUE                   _UINT32_(0x00)                                       /*  (GPIO_ODC)   Reset Value */

#define GPIO_ODC_ODC0_Pos                     _UINT32_(0)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC0_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC0_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC0(value)                  (GPIO_ODC_ODC0_Msk & (_UINT32_(value) << GPIO_ODC_ODC0_Pos)) /* Assigment of value for ODC0 in the GPIO_ODC register */
#define GPIO_ODC_ODC1_Pos                     _UINT32_(1)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC1_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC1_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC1(value)                  (GPIO_ODC_ODC1_Msk & (_UINT32_(value) << GPIO_ODC_ODC1_Pos)) /* Assigment of value for ODC1 in the GPIO_ODC register */
#define GPIO_ODC_ODC2_Pos                     _UINT32_(2)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC2_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC2_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC2(value)                  (GPIO_ODC_ODC2_Msk & (_UINT32_(value) << GPIO_ODC_ODC2_Pos)) /* Assigment of value for ODC2 in the GPIO_ODC register */
#define GPIO_ODC_ODC3_Pos                     _UINT32_(3)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC3_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC3_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC3(value)                  (GPIO_ODC_ODC3_Msk & (_UINT32_(value) << GPIO_ODC_ODC3_Pos)) /* Assigment of value for ODC3 in the GPIO_ODC register */
#define GPIO_ODC_ODC4_Pos                     _UINT32_(4)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC4_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC4_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC4(value)                  (GPIO_ODC_ODC4_Msk & (_UINT32_(value) << GPIO_ODC_ODC4_Pos)) /* Assigment of value for ODC4 in the GPIO_ODC register */
#define GPIO_ODC_ODC5_Pos                     _UINT32_(5)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC5_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC5_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC5(value)                  (GPIO_ODC_ODC5_Msk & (_UINT32_(value) << GPIO_ODC_ODC5_Pos)) /* Assigment of value for ODC5 in the GPIO_ODC register */
#define GPIO_ODC_ODC6_Pos                     _UINT32_(6)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC6_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC6_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC6(value)                  (GPIO_ODC_ODC6_Msk & (_UINT32_(value) << GPIO_ODC_ODC6_Pos)) /* Assigment of value for ODC6 in the GPIO_ODC register */
#define GPIO_ODC_ODC7_Pos                     _UINT32_(7)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC7_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC7_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC7(value)                  (GPIO_ODC_ODC7_Msk & (_UINT32_(value) << GPIO_ODC_ODC7_Pos)) /* Assigment of value for ODC7 in the GPIO_ODC register */
#define GPIO_ODC_ODC8_Pos                     _UINT32_(8)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC8_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC8_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC8(value)                  (GPIO_ODC_ODC8_Msk & (_UINT32_(value) << GPIO_ODC_ODC8_Pos)) /* Assigment of value for ODC8 in the GPIO_ODC register */
#define GPIO_ODC_ODC9_Pos                     _UINT32_(9)                                          /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC9_Msk                     (_UINT32_(0x1) << GPIO_ODC_ODC9_Pos)                 /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC9(value)                  (GPIO_ODC_ODC9_Msk & (_UINT32_(value) << GPIO_ODC_ODC9_Pos)) /* Assigment of value for ODC9 in the GPIO_ODC register */
#define GPIO_ODC_ODC10_Pos                    _UINT32_(10)                                         /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC10_Msk                    (_UINT32_(0x1) << GPIO_ODC_ODC10_Pos)                /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC10(value)                 (GPIO_ODC_ODC10_Msk & (_UINT32_(value) << GPIO_ODC_ODC10_Pos)) /* Assigment of value for ODC10 in the GPIO_ODC register */
#define GPIO_ODC_ODC11_Pos                    _UINT32_(11)                                         /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC11_Msk                    (_UINT32_(0x1) << GPIO_ODC_ODC11_Pos)                /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC11(value)                 (GPIO_ODC_ODC11_Msk & (_UINT32_(value) << GPIO_ODC_ODC11_Pos)) /* Assigment of value for ODC11 in the GPIO_ODC register */
#define GPIO_ODC_ODC12_Pos                    _UINT32_(12)                                         /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC12_Msk                    (_UINT32_(0x1) << GPIO_ODC_ODC12_Pos)                /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC12(value)                 (GPIO_ODC_ODC12_Msk & (_UINT32_(value) << GPIO_ODC_ODC12_Pos)) /* Assigment of value for ODC12 in the GPIO_ODC register */
#define GPIO_ODC_ODC13_Pos                    _UINT32_(13)                                         /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC13_Msk                    (_UINT32_(0x1) << GPIO_ODC_ODC13_Pos)                /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC13(value)                 (GPIO_ODC_ODC13_Msk & (_UINT32_(value) << GPIO_ODC_ODC13_Pos)) /* Assigment of value for ODC13 in the GPIO_ODC register */
#define GPIO_ODC_ODC14_Pos                    _UINT32_(14)                                         /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC14_Msk                    (_UINT32_(0x1) << GPIO_ODC_ODC14_Pos)                /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC14(value)                 (GPIO_ODC_ODC14_Msk & (_UINT32_(value) << GPIO_ODC_ODC14_Pos)) /* Assigment of value for ODC14 in the GPIO_ODC register */
#define GPIO_ODC_ODC15_Pos                    _UINT32_(15)                                         /* (GPIO_ODC)  Position */
#define GPIO_ODC_ODC15_Msk                    (_UINT32_(0x1) << GPIO_ODC_ODC15_Pos)                /* (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC15(value)                 (GPIO_ODC_ODC15_Msk & (_UINT32_(value) << GPIO_ODC_ODC15_Pos)) /* Assigment of value for ODC15 in the GPIO_ODC register */
#define GPIO_ODC_Msk                          _UINT32_(0x0000FFFF)                                 /* (GPIO_ODC) Register Mask  */

#define GPIO_ODC_ODC_Pos                      _UINT32_(0)                                          /* (GPIO_ODC Position)  */
#define GPIO_ODC_ODC_Msk                      (_UINT32_(0xFFFF) << GPIO_ODC_ODC_Pos)               /* (GPIO_ODC Mask) ODC */
#define GPIO_ODC_ODC(value)                   (GPIO_ODC_ODC_Msk & (_UINT32_(value) << GPIO_ODC_ODC_Pos)) 

